DCC-Lab/Lemming/Code/Code Dependencies/Windows/firebeetle32/hardware/esp32/0.1.1/boards.txt
menu.UploadSpeed=Upload Speed
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.Revision=Board Revision

##############################################################

firebeetle32.name=FireBeetle-ESP32

firebeetle32.upload.tool=esptool_py
firebeetle32.upload.maximum_size=1310720
firebeetle32.upload.maximum_data_size=327680
firebeetle32.upload.wait_for_upload_port=true

firebeetle32.serial.disableDTR=true
firebeetle32.serial.disableRTS=true

firebeetle32.build.mcu=esp32
firebeetle32.build.core=esp32
firebeetle32.build.variant=firebeetle32
firebeetle32.build.board=ESP32_DEV

firebeetle32.build.f_cpu=240000000L
firebeetle32.build.flash_mode=dio
firebeetle32.build.flash_size=4MB
firebeetle32.build.boot=dio
firebeetle32.build.partitions=default
firebeetle32.build.defines=

firebeetle32.menu.FlashFreq.80=80MHz
firebeetle32.menu.FlashFreq.80.build.flash_freq=80m
firebeetle32.menu.FlashFreq.40=40MHz
firebeetle32.menu.FlashFreq.40.build.flash_freq=40m

firebeetle32.menu.UploadSpeed.921600=921600
firebeetle32.menu.UploadSpeed.921600.upload.speed=921600
firebeetle32.menu.UploadSpeed.115200=115200
firebeetle32.menu.UploadSpeed.115200.upload.speed=115200
firebeetle32.menu.UploadSpeed.256000.windows=256000
firebeetle32.menu.UploadSpeed.256000.upload.speed=256000
firebeetle32.menu.UploadSpeed.230400.windows.upload.speed=256000
firebeetle32.menu.UploadSpeed.230400=230400
firebeetle32.menu.UploadSpeed.230400.upload.speed=230400
firebeetle32.menu.UploadSpeed.460800.linux=460800
firebeetle32.menu.UploadSpeed.460800.macosx=460800
firebeetle32.menu.UploadSpeed.460800.upload.speed=460800
firebeetle32.menu.UploadSpeed.512000.windows=512000
firebeetle32.menu.UploadSpeed.512000.upload.speed=512000


firebeetle32.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
firebeetle32.menu.PartitionScheme.default.build.partitions=default
firebeetle32.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
firebeetle32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
firebeetle32.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
firebeetle32.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
firebeetle32.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
firebeetle32.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
firebeetle32.menu.PartitionScheme.minimal.build.partitions=minimal
firebeetle32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
firebeetle32.menu.PartitionScheme.no_ota.build.partitions=no_ota
firebeetle32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
firebeetle32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
firebeetle32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
firebeetle32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
firebeetle32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
firebeetle32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
firebeetle32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
firebeetle32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
firebeetle32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
firebeetle32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
firebeetle32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
firebeetle32.menu.PartitionScheme.huge_app.build.partitions=huge_app
firebeetle32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
firebeetle32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
firebeetle32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
firebeetle32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
firebeetle32.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
firebeetle32.menu.PartitionScheme.fatflash.build.partitions=ffat
firebeetle32.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
firebeetle32.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
firebeetle32.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
firebeetle32.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

firebeetle32.menu.DebugLevel.none=None
firebeetle32.menu.DebugLevel.none.build.code_debug=0
firebeetle32.menu.DebugLevel.error=Error
firebeetle32.menu.DebugLevel.error.build.code_debug=1
firebeetle32.menu.DebugLevel.warn=Warn
firebeetle32.menu.DebugLevel.warn.build.code_debug=2
firebeetle32.menu.DebugLevel.info=Info
firebeetle32.menu.DebugLevel.info.build.code_debug=3
firebeetle32.menu.DebugLevel.debug=Debug
firebeetle32.menu.DebugLevel.debug.build.code_debug=4
firebeetle32.menu.DebugLevel.verbose=Verbose
firebeetle32.menu.DebugLevel.verbose.build.code_debug=5
